//- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr = ['a','b','c'];
// for (let i =1; i<=3;i++){
//     arr.push(i);
// }
//console.log(arr);
//////2/////
// let arr = ['a','b','c'];
// let numbers = [1,2,3];
// for(let num of numbers){
//     arr.push(num);
// }
// console.log(arr);
/////////////////////////////////////////////////////////
//Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let numbers=[1,2,3];
// let numbers2=[];
// for (let i = numbers.length -1; i >=0; i--) {
//     numbers2.push(numbers[i]);
// }
// console.log(numbers2);
//////////////////////////////////////////////////////////
//- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let arr=[1,2,3];
// let dop =[4,5,6];
// for (const dopElement of dop) {
//     arr.push(dopElement);
// }
// console.log(arr);
///////////////////////////////////////////////////////////////
//- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let arr=[1,2,3];
// let dop =[4,5,6];
// for (let i = arr.length -1; i >=0; i--) {
//     arr.unshift(dop[i]);
// }
// console.log(arr);
///////////////////////////////////////////////////////////////
//- Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// let arr = ['js', 'css', 'jq'];
// //// let a= arr.shift(0);
// ////console.log(a);
// console.log(arr.shift());
//////////////////////////////////
//- Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr = ['js', 'css', 'jq'];
// // console.log(arr.pop());
////////////////////////////////////////////
//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
// let arr=[1, 2, 3, 4, 5];
// for (let i = 0; i < 3; i++) {
//     arr.shift();
// }
// console.log(arr);
/////////////////////////////////////////////
//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
// let arr=[1, 2, 3, 4, 5];
// for (let i = 0; i < 3; i++) {
//     arr.pop();
// }
// console.log(arr);
//////////////////////////
//- Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
// let arr = [1, 2, 3, 4, 5];
// let abc = ['a','b','c'];
// let del1 = arr.pop();
// let del2 = arr.pop();
// for (const abcElement of abc) {
//     arr.push(abcElement);
// }
// arr.push(del2);
// arr.push(del1);
// console.log(arr);
////////////222222/////////// не понял как правильно
// let arr = [1, 2, 3, 4, 5];
// let abc = ['a','b','c'];
// for (let i = 0; i < 2; i++) {
//     arr.pop();}
// for (const abcElement of abc) {
//     arr.push(abcElement);
// }
// for (let i = 4; i <= 5;  i++) {
//     arr.push(i);
// }
// console.log(arr);
///////////////////////////////////////////////////
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
// let arr = [1, 2, 3, 4, 5];
// let abc = ['a','b','c','e'];
// let arr9 = [];
// arr9.push(arr[0]);
// arr9.push(abc[0]);
// arr9.push(abc[1]);
// arr9.push(arr[1]);
// arr9.push(arr[2]);
// arr9.push(arr[3]);
// arr9.push(abc[2]);
// arr9.push(arr[4]);
// arr9.push(abc[3]);
// console.log(arr9);
//////////////////////////////////
//- Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let arr = [1,2,3,4,5,6,7,8,9,10];
// for (let i = 1; i < arr.length; i+=2) {
//     console.log(arr[i]);
// }
// ////////////////////////////////////////////////////
//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [1,2,3,4,5,6,7,8,9,10];
// let emp = [];
// for (const number of arr) {
//     emp.push(number) ;
// }
// console.log(emp);
/////////////////////////////////////////
//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let arr = [1,2,3,4,5,6,7,8,9,10];
// let emp = [];
// for (let i = 0; i < arr.length; i++) {
//     emp.push(arr[i]);
// }
// console.log(emp);
//////////////////////////////////////